app/Controllers/Store.php

    public function index()
    {

        $productModel = new ProductModel();
        $db = db_connect();

        $builder = $db->table('products');
        $builder->select('products.*, users.no_hp');
        $builder->join('users', 'users.id = products.id_user');
        $data['products'] = $builder->get()->getResultArray();
---
SELECT `products`.*, `users`.`no_hp`
FROM `products`
JOIN `users` ON `users`.`id` = `products`.`id_user`